M9W24 Rails/tiny/app/controllers/urls_controller.rb

INSERT INTO "urls" ("shortURL", "longURL", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["shortURL", "sjsjsjsjssj"], ["longURL", "www.google.ca"], ["created_at", "2023-09-27 01:25:44.498092"], ["updated_at", "2023-09-27 01:25:44.498092"], ["user_id", nil]]
---
  def create
    puts "----------------"
    puts params[:url]
    # byebug
    url = Url.new( url_params)
    url.shortURL = SecureRandom.base64(10)
    url.save